{
  "CWE-119": "CWE-119: Improper Restriction of Operations within the Bounds of a Memory Buffer\tDescription: The product performs operations on a memory buffer, but it can read from or write to a memory location that is outside of the intended boundary of the buffer.",
  "CWE-125": "CWE-125: Out-of-bounds Read\tDescription: The product reads data past the end, or before the beginning, of the intended buffer.",
  "CWE-20": "CWE-20: Improper Input Validation\tDescription: The product receives input or data, but it does not validate or incorrectly validates that the input has the properties that are required to process the data safely and correctly.",
  "CWE-476": "CWE-476: NULL Pointer Dereference\tDescription: A NULL pointer dereference occurs when the application dereferences a pointer that it expects to be valid, but is NULL, typically causing a crash or exit",
  "CWE-787": "CWE-787: Out-of-bounds Write\tDescription: The product writes data past the end, or before the beginning, of the intended buffer.",
  "CWE-190": "CWE-190: Integer Overflow or Wraparound\tDescription: The product performs a calculation that can produce an integer overflow or wraparound, when the logic assumes that the resulting value will always be larger than the original value. This can introduce other weaknesses when the calculation is used for resource management or execution control.",
  "CWE-362": "CWE-362: Concurrent Execution using Shared Resource with Improper Synchronization ('Race Condition')\tDescription: The product contains a code sequence that can run concurrently with other code, and the code sequence requires temporary, exclusive access to a shared resource, but a timing window exists in which the shared resource can be modified by another code sequence that is operating concurrently.",
  "CWE-416": "CWE-416: Use After Free\tDescription: Referencing memory after it has been freed can cause a program to crash, use unexpected values, or execute code.",
  "CWE-400": "CWE-400: Uncontrolled Resource Consumption\tDescription: The product does not properly control the allocation and maintenance of a limited resource, thereby enabling an actor to influence the amount of resources consumed, eventually leading to the exhaustion of available resources.",
  "CWE-401": "CWE-400: Uncontrolled Resource Consumption\tDescription: The product does not properly control the allocation and maintenance of a limited resource, thereby enabling an actor to influence the amount of resources consumed, eventually leading to the exhaustion of available resources.",
  "CWE-772": "CWE-772: Missing Release of Resource after Effective Lifetime\tDescription: The product does not release a resource after its effective lifetime has ended, i.e., after the resource is no longer needed.",
  "CWE-269": "CWE-269: Improper Privilege Management\tDescription: The product does not properly assign, modify, track, or check privileges for an actor, creating an unintended sphere of control for that actor.",
  "CWE-120": "CWE-120: Buffer Copy without Checking Size of Input ('Classic Buffer Overflow')\tDescription: The product copies an input buffer to an output buffer without verifying that the size of the input buffer is less than the size of the output buffer, leading to a buffer overflow.",
  "CWE-415": "CWE-415: Double Free\tDescription: The product calls free() twice on the same memory address, potentially leading to modification of unexpected memory locations.",
  "CWE-835": "CWE-835: Loop with Unreachable Exit Condition ('Infinite Loop')\tDescription: The product contains an iteration or loop with an exit condition that cannot be reached, i.e., an infinite loop.",
  "CWE-295": "CWE-295: Improper Certificate Validation\tDescription: The product does not validate, or incorrectly validates, a certificate.",
  "CWE-674": "CWE-674: Uncontrolled Recursion\tDescription: The product does not properly control the amount of recursion that takes place, consuming excessive resources, such as allocated memory or the program stack.",
  "CWE-404": "CWE-404: Improper Resource Shutdown or Release\tDescription: The product does not release or incorrectly releases a resource before it is made available for re-use.",
  "CWE-78": "CWE-78: Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection')\tDescription: The product constructs all or part of an OS command using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended OS command when it is sent to a downstream component.",
  "CWE-369": "CWE-369: Divide By Zero\tDescription: The product divides a value by zero.",
  "CWE-908": "CWE-908: Use of Uninitialized Resource\tDescription: The product uses or accesses a resource that has not been initialized.",
  "CWE-134": "CWE-134: Use of Externally-Controlled Format String\tDescription: The product uses a function that accepts a format string as an argument, but the format string originates from an external source.",
  "CWE-77": "CWE-77: Improper Neutralization of Special Elements used in a Command ('Command Injection')\tDescription: The product constructs all or part of a command using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended command when it is sent to a downstream component.",
  "CWE-252": "CWE-252: Unchecked Return Value\tDescription: The product does not check the return value from a method or function, which can prevent it from detecting unexpected states and conditions.",
  "CWE-763": "CWE-763: Release of Invalid Pointer or Reference\tDescription: The product attempts to return a memory resource to the system, but it calls the wrong release function or calls the appropriate release function incorrectly.",
  "CWE-732": "CWE-732: Incorrect Permission Assignment for Critical Resource\tDescription: The product specifies permissions for a security-critical resource in a way that allows that resource to be read or modified by unintended actors.",
  "CWE-665": "CWE-665: Improper Initialization\tDescription: The product does not initialize or incorrectly initializes a resource, which might leave the resource in an unexpected state when it is accessed or used.",
  "CWE-354": "CWE-354: Improper Validation of Integrity Check Value\tDescription: The product does not validate or incorrectly validates the integrity check values or \"checksums\" of a message. This may prevent it from detecting if the data has been modified or corrupted in transmission.",
  "CWE-667": "CWE-667: Improper Locking\tDescription: The product does not properly acquire or release a lock on a resource, leading to unexpected resource state changes and behaviors.",
  "CWE-129": "CWE-129: Improper Validation of Array Index\tDescription: The product uses untrusted input when calculating or using an array index, but the product does not validate or incorrectly validates the index to ensure the index references a valid position within the array.",
  "CWE-89": "CWE-89: Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')\tDescription: The product constructs all or part of an SQL command using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended SQL command when it is sent to a downstream component.",
  "CWE-770": "CWE-770: Allocation of Resources Without Limits or Throttling\tDescription: The product allocates a reusable resource or group of resources on behalf of an actor without imposing any restrictions on the size or number of resources that can be allocated, in violation of the intended security policy for that actor.",
  "CWE-191": "CWE-191: Integer Underflow (Wrap or Wraparound)\tDescription: The product subtracts one value from another, such that the result is less than the minimum allowable integer value, which produces a value that is not equal to the correct result.",
  "CWE-754": "CWE-754: Improper Check for Unusual or Exceptional Conditions\tDescription: The product does not check or incorrectly checks for unusual or exceptional conditions that are not expected to occur frequently during day to day operation of the product.",
  "CWE-273": "CWE-273: Improper Check for Dropped Privileges\tDescription: The product attempts to drop privileges but does not check or incorrectly checks to see if the drop succeeded.",
  "CWE-426": "CWE-426: Untrusted Search Path\tDescription: The product searches for critical resources using an externally-supplied search path that can point to resources that are not under the product's direct control.",
  "CWE-682": "CWE-682: Incorrect Calculation\tDescription: The product performs a calculation that generates incorrect or unintended results that are later used in security-critical decisions or resource management.",
  "CWE-327": "CWE-327: Use of a Broken or Risky Cryptographic Algorithm\tDescription: The product uses a broken or risky cryptographic algorithm or protocol.",
  "CWE-681": "CWE-681: Incorrect Conversion between Numeric Types\tDescription: When converting from one data type to another, such as long to integer, data can be omitted or translated in a way that produces unexpected values. If the resulting values are used in a sensitive context, then dangerous behaviors may occur.",
  "CWE-193": "CWE-193: Off-by-one Error\tDescription: A product calculates or uses an incorrect maximum or minimum value that is 1 more, or 1 less, than the correct value.",
  "CWE-290": "CWE-290: Authentication Bypass by Spoofing\tDescription: This attack-focused weakness is caused by incorrectly implemented authentication schemes that are subject to spoofing attacks.",
  "CWE-672": "CWE-672: Operation on a Resource after Expiration or Release\tDescription: The product uses, accesses, or otherwise operates on a resource after that resource has been expired, released, or revoked.",
  "CWE-000": "CWE-000 Unknown CWE type and no descriptions"
}